; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-11)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 )
(:init
(arm-empty)
(on-table b1)
(on b2 b8)
(on b3 b2)
(on b4 b5)
(on b5 b6)
(on b6 b10)
(on b7 b1)
(on b8 b9)
(on b9 b7)
(on b10 b11)
(on b11 b3)
(clear b4)
)
(:goal
(and
(on b1 b2)
(on b2 b9)
(on b4 b5)
(on b5 b1)
(on b6 b3)
(on b8 b7)
(on b9 b8)
(on b10 b6))
)
)

; plan
1. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 0 of 8
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 0 of 8
3. (unstack b5 b6)
   deleted: (on b5 b6) (clear b5) (arm-empty)
   added: (holding b5) (clear b6)
   goals met: 0 of 8
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 8
5. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 0 of 8
6. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 8
7. (unstack b10 b11)
   deleted: (on b10 b11) (clear b10) (arm-empty)
   added: (holding b10) (clear b11)
   goals met: 0 of 8
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 8
9. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 0 of 8
10. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 8
11. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 0 of 8
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 8
13. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 0 of 8
14. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 1 of 8
15. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 1 of 8
16. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 8
17. (unstack b8 b9)
   deleted: (on b8 b9) (clear b8) (arm-empty)
   added: (holding b8) (clear b9)
   goals met: 1 of 8
18. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 8
19. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 1 of 8
20. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 8
21. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 1 of 8
22. (stack b10 b6)
   deleted: (clear b6) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b6)
   goals met: 2 of 8
23. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 2 of 8
24. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 8
25. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 2 of 8
26. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 3 of 8
27. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 3 of 8
28. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 4 of 8
29. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 8
30. (stack b2 b9)
   deleted: (clear b9) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b9)
   goals met: 5 of 8
31. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 8
32. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 8
33. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 8
34. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 8
35. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 8
36. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 8 of 8
